Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] Meow Rangers.tmx
Source language: ko_kr
Languages: en_us

source: 하...하지만, 연구 조사를 더...!
en_us: B-BUT, WE NEED TO RUN MORE TESTS...!

source: 집사레인저는...
en_us: ...THE MEOW RANGERS...

source: 이자식...!!
en_us: YOU BASTARD...!!

source: 이...이거 혹시...
en_us: C-COULD THIS BE...

source: 네녀석도...!!
en_us: YOU PUNK...!!

source: 함선도 kiti의 영역.
en_us: KITI CONTROLS THE SHIP AS WELL.

source: 너희 집사들과 우리들은 짊어진 각오의 무게가 다르다고.
en_us: YOUR BURDEN IS NOT THE SAME AS OURS.

source: 여기도 그 잘난 근육으로 막아보시지!!
en_us: TRY BLOCKING THIS WITH YOUR MUSCLES!!

source: 모두들...!!
en_us: ...EVERYONE...

source: 학생이었냐고!!
en_us: SHE’S A STUDENT?!

source: 어디 다치진 않았습니까.
en_us: ARE YOU HURT ANYWHERE?

source: 콰 앙
en_us: CRASH

source: 평소같았으면 그냥 보내줬겠지만...
en_us: NORMALLY, I WOULDN’T EVEN BOTHER WITH YOU...

source: 민식이를 잃은 제냐한테 가서 그렇게 말해봐...!!
en_us: TRY TELLING XENIA ABOUT IT AFTER SHE’S LOST MINSIK...!!

source: 일...어..나..!!
en_us: GET... UP...

source: [집사레인저]란?
en_us: WHAT’S A MEOW RANGER, YOU ASK?

source: 네로가 나타났다며.
en_us: I HEARD NERO’S BACK.

source: 학비부터 대학교 등록금, 취업 지원금까지 해준다고 하고...
en_us: THEY SAY THEY PAY FOR SCHOOL FEES, COLLEGE TUITION, AND EMPLOYMENT APPLICATION FEES...

source: 지구를 지키는 전사였지만
en_us: ...USED TO BE A WARRIOR WHO PROTECTED EARTH...

source: 관절염이...!
en_us: ARTHRITIS...!

source: 깜돌...!?
en_us: SHADOW...?!

source: 우오옷!
en_us: WHOA!

source: 처억
en_us: BAM

source: 아니다...
en_us: NEVERMIND...

source: 젠장!!
en_us: DAMN IT!!

source: 훗, 내 발목을 잡는 건 허락해줄테니 얼마든지 잡으라고.
en_us: HA, YOU CAN HOLD ME BACK WHENEVER YOU WANT.

source: 뻔하지만...
en_us: IT’S OBVIOUS, BUT...

source: 캣슈트와 그 내부까지는 내 염동력이 닿질 않는군...
en_us: MY TELEKINESIS DOESN’T WORK INSIDE YOUR CATSUIT...

source: 네게 동맹을 제안한다.
en_us: I PROPOSE WE FORM AN ALLIANCE.

source: ㅋㅋㅋㅋ
en_us: HAHAHAHA!

source: 세뇌파가 느껴졌다.
en_us: I FELT THE BRAINWASHING WAVES.

source: 케헥-!!
en_us: UGHH!!

source: 촤{j}앗
en_us: SLASH{j}

source: 사랑의 매
en_us: STICK OF LOVE

source: 네 시계를..
en_us: GIVE ME...

source: 왜 안 보이는 거냐고...!
en_us: WHERE IS HE...?!

source: 멀쩡하답니다.
en_us: ALL BETTER.

source: 여기 혹시...
en_us: IS THIS...

source: 도...도망친 거 아니야!?
en_us: D-DID HE RUN AWAY?!

source: 현민...
en_us: HYEONMIN...

source: 모자란 고등학생일 뿐인데.
en_us: A FOOLISH HIGH SCHOOL STUDENT.

source: 어떻게 된 거냐...?
en_us: TO US...?

source: 잡았어...!
en_us: GOT YOU...!

source: 그러고보니,
en_us: COME TO THINK OF IT...

source: 네가 핑크의 주인...
en_us: ARE YOU THE PINK RANGER’S OWNER...

source: 소용없어!
en_us: IT’S USELESS!

source: 웅
en_us: RRR

source: 그거 동생한테 들었어!
en_us: MY LITTLE SISTER TOLD ME ABOUT IT!

source: 놓으라고!!
en_us: I SAID LET GO OF ME!

source: 가까이 접근만해도 경보가 울리겠지.
en_us: THE ALARMS WILL GO OFF IF WE EVEN GET CLOSE TO IT.

source: 냥잼 이식술을 받을 그릇이 못 돼!!
en_us: HE’S NOT WORTHY OF THE MEOW GEM TRANSPLANT SURGERY!!

source: 6학년 남자 애들을 상대로 겁도없이 덤볐었지.
en_us: ...TO TAKE VENGEANCE FOR HER BROTHER.

source: 그렇게 쉽게 쓰러질 녀석이 아니야.
en_us: HE WON’T BE BEATEN SO EASILY.

source: 그것을 과시하고 싶을 뿐인 집사...
en_us: WANTING ONLY TO SHOW IT OFF...

source: 중요한 건...
en_us: WHAT’S IMPORTANT IS...

source: 어이없네?!
en_us: I CAN’T BELIEVE THIS!

source: 뭐가 어떻게 된 거야!!
en_us: JUST WHAT IS GOING ON?!

source: 강력해...!!!
en_us: HE’S SO STRONG...!!!

source: 존예!!
en_us: SHE’S DROP DEAD GORGEOUS!!

source: 에너지 출력을 약하게 해서 사용한다든가...
en_us: IT MUST BE USED AT A LOWER POWER OUTPUT...

source: 저길 봐!!
en_us: LOOK OVER THERE!!

source: 시끄러워!
en_us: SHUT UP!

source: 그 멍청이 근육 녀석이 안 보이잖아...?
en_us: WHERE’S THAT MORON MUSCLE CAT...?

source: 겨우 공포 따위로 나를 굴복 시킬 수 있을 줄 알았나!!
en_us: YOU REALLY THOUGHT YOU COULD CONTROL ME WITH FEAR?!

source: 빗나갔나...?
en_us: DID I MISS...?

source: 찾아왔다고?
en_us: CAME TO SEE YOU?

source: 혼수상태 기간을 고려하면 놀랄 만큼 상태가 양호합니다.
en_us: CONSIDERING HOW LONG YOU WERE COMATOSE, YOU’RE DOING REMARKABLY WELL.

source: 지배하는 게 아니라 고통 받는 냥인들을 구원하는 거였지.
en_us: NO. WE JUST WANTED TO RESCUE THE CAT PEOPLE FROM THEIR SUFFERING.

source: 우 우 우 웅
en_us: WHIIIR

source: 이것 저것 실험 당했지.
en_us: BUT I’VE BEEN PUT UNDER ALL KINDS OF EXPERIMENTS.

source: 집사레인저에 대해...
en_us: ...AFTER THE BATTLE...

source: 쮝쮝!!
en_us: TWEEK TWEEK!!

source: 겨우 한 달인데 사람들이 이렇게까지 적응해버리다니.
en_us: IT’S ONLY BEEN A MONTH AND PEOPLE ARE ALREADY USED TO IT?

source: 아니면...
en_us: OR...

source: 결국 인간은 냥인에게 지게 되어있어.
en_us: HUMANS WILL LOSE IN THE END.

source: 우...{j}웃기지마...!!
en_us: D-DON’T MAKE ME LAUGH...!!{j}

source: 젠장, 다 끝났어!
en_us: CRAP, IT’S ALL OVER!

source: 꼼짝마-!
en_us: DONT MOVE!

source: 아니, 모집 하고 있겠지.
en_us: NO, RECRUITING HUMANS...

source: 냥인들을 위해 싸운다는 네로 패거리 맞지?!
en_us: YOU’RE WITH NERO’S GROUP FIGHTING TO PROTECT CAT PEOPLE, RIGHT?!

source: 가라!!!
en_us: GO!!!

source: 저항하면 다칩니다?
en_us: RESIST, AND YOU WILL BE PUNISHED!

source: 닥
en_us: GRR

source: 중요 장기 파괴.
en_us: MAJOR ORGANS DAMAGED.

source: 지켜야 될 소중한 사람들...!
en_us: OUR LOVED ONES THAT WE HAVE TO PROTECT...!

source: 미...{j}미안...!!
en_us: S-SORRY...!!{j}

source: 다른 냥잼으로 힘을 되찾았다.
en_us: I GOT MY POWER BACK USING ANOTHER MEOW GEM.

source: 실컷 맛 봐.
en_us: EAT UP.

source: 실험체, 혹은 냥인들의 간식으로 활용하기 위해서.
en_us: ...TO USE THEM AS EXPERIMENTAL SUBJECTS OR TREATS FOR CAT PEOPLE.

source: 간단하게 설명하자면...
en_us: SIMPLY PUT...

source: 주변 인프라 걱정없는
en_us: MULTI-PURPOSE APARTMENT COMPLEXES

source: 네로가...
en_us: NERO...

source: 안심하라고!?
en_us: DON’T WORRY?!

source: 난 또 뭐라구...
en_us: SO THAT’S WHAT IT WAS...

source: 이해해주십시오.
en_us: PLEASE UNDERSTAND.

source: 오래 살고 싶습니다.
en_us: I WANT TO LIVE A LONG LIFE.

source: 크윽..
en_us: GRRR

source: 같은 수장으로서 존중의 마음을 담은 선물을 주마.
en_us: AS A FELLOW LEADER, I’LL GIVE YOU AN HONORABLE PARTING GIFT.

source: 믿고 따라주마.
en_us: I WILL TRUST THEM AND DO AS THEY SAY.

source: 야야, 저기 봐.
en_us: HEY, LOOK.

source: 회복 불능.
en_us: UNABLE TO RECOVER.

source: 야, 니 얼굴 기억했다.
en_us: HEY, I’M GONNA REMEMBER YOUR FACE...

source: 너무 빨라...!!
en_us: IT’S TOO SOON...!!

source: 임시 세계 대통령 입니다.
en_us: I AM THE INTERIM WORLD PRESIDENT.

source: 받아라.
en_us: TAKE THIS.

source: 정신 차려!!
en_us: WAKE UP!!

source: 예시
en_us: ILLUSTRATION

source: 나는 간다.
en_us: I’LL JOIN...

source: 냥인과 인간이 지금처러만 지내준다면...
en_us: IF CAT PEOPLE AND HUMANS GET ALONG LIKE WE DO NOW...

source: 과거 선조들은...
en_us: OUR ANCESTORS...

source: 빌어먹을 네로자식!!
en_us: DAMN YOU, NERO!!

source: 몰랐음
en_us: DIDN’T KNOW EITHER

source: 좀 나눠줘요.
en_us: GIVE US SOME.

source: 나만의 영역이 아니라는 걸 잠시 잊었군.
en_us: I FORGOT FOR A MOMENT THAT I WASN’T THE ONLY ONE.

source: 뭐야?
en_us: HUH?

source: 라고,
en_us: ...IS WHAT...

source: 기쁜 마음으로 생체 실험 연구 대상이 되어주세요.
en_us: I HOPE YOU’LL CHOOSE TO BE A COMPLIANT TEST SUBJECT.

source: 세호...
en_us: SEHO...

source: ...쮝...쮝! (아 현기증이...!)
en_us: TWEEK... TWEEK! (I’M DIZZY!)

source: 이야아아앗-!!
en_us: HIYAAA!!

source: 저 대신 제냐 좀...
en_us: BUT PLEASE...

source: 버티게...
en_us: ...HANG IN THERE...

source: 큭...큭...큭...
en_us: HA... HA... HA...

source: 고귀하신 왕자님께서 이런 전쟁터엔 무슨일로?
en_us: SO WHAT BRINGS OUR NOBLE PRINCE TO THIS BATTLEFIELD?

source: 취 이 이 익
en_us: HISSS

source: 그리고 녀석들의 냥잼 하나를 더 뺏어왔습니다.
en_us: ...THE MEOW GEM SENT DOWN FROM THE SHIP TODAY AND THE ONE I TOOK FROM THE ENEMY.

source: 이 사람이라면 믿고 도움 받을 수 있어.'
en_us: SOMEONE WHO MAKES YOU THINK...

source: 번 쩍
en_us: WOOSH

source: 뭐냐고!!
en_us: WHAT IS HAPPENING?!

source: 인간 재활용, 캣닢 재배.
en_us: RECYCLING THE HUMANS, CULTIVATING CATNIP.

source: 죽었어!!
en_us: IT’S DEAD!!

source: 깜돌의 말처럼 쓸데없는 일에 너무 힘 빼버렸잖아...
en_us: I’M EXHAUSTING MY STRENGTH FOR NO REASON, JUST LIKE SHADOW SAID...

source: 애들 괴롭히고 다니던 일진 주제에.
en_us: YOU’RE NOTHING BUT A BULLY WHO PICKED ON OTHER KIDS.

source: 그들이 들어갈 곳은 집이 아니라...
en_us: WHAT THEY’LL FIND IS NOT A HOUSE...

source: 저의 진짜 임무를...
en_us: ...MY REAL MISSION...

source: 이번엔 맞히긴 커녕...
en_us: BUT THIS TIME...

source: 죽어!!
en_us: DIE!!

source: 꾹
en_us: POKE

source: 그들의 차원이 다른 과학 기술력을 본 인간들은 저항하기를 포기했다.
en_us: ...BUT HUMAN RESISTENCE DROPPED ONCE THEY SAW THE CAT PEOPLE’S NEXT-LEVEL SCIENCE AND TECHNOLOGY.

source: 3개월 안에 업적을 인정받는 건...{j}불가능에 가까...
en_us: GETTING ACKNOWLEDGED FOR AN ACHIEVEMENT WITHIN THREE MONTHS... WILL BE NEARLY IMPOSSIBLE...{j}

source: 믿어라.{j}치와.
en_us: TRUST US, CHIWA.{j}

source: 헛 걸 보고 있는 건가...?
en_us: AM I HALLUCINATING...?

source: 살려주세요!
en_us: PLEASE SPARE ME!

source: 빔을 맞고도 버텼어...!
en_us: HE WITHSTOOD THE LASER BEAM...!

source: 꺼져라, 애송이들.
en_us: GET OUT OF HERE, ROOKIES.

source: 네놈을 믿어줬건만...!
en_us: I TRUSTED YOU...

source: 파앗
en_us: SHOVE

source: 그저 제안입니다.
en_us: IT’S SIMPLY A SUGGESTION.

source: 이 공격도 피해봐!
en_us: TRY DODGING THIS!

source: 다행히 제냐 언니는 살았지만...
en_us: LUCKILY, XENIA SURVIVED...

source: 곧 구하러 올테니!!
en_us: I’LL COME BACK TO SAVE YOU SOON!!

source: 캣닢하고 오자.
en_us: LET’S GO DO SOME CATNIP.

source: 이게
en_us: IS THAT...

source: 겨...결계를 찢었어...!
en_us: SH-SHE BROKE THE SHIELD...!

source: 지금 이 순간에도, 냥인들은 인간들을 포획...
en_us: EVEN AT THIS MOMENT, CAT PEOPLE ARE CAPTURING--

source: 딸랑
en_us: DING DING

source: 엄마까지 낚였어...
en_us: THEY HOOKED EVEN MY MOM...

source: 한 대, 두 대, 세 대, 네 대.
en_us: ONE STRIKE, TWO STRIKES, THREE STRIKES, FOUR STRIKES.

source: 만약...
en_us: WHAT IF...

source: 그건 포기해야 겠어.
en_us: I’LL HAVE TO GIVE UP ON THAT ONE.

source: 사랑한다...
en_us: I LOVE YOU...

source: 이 자식이...!
en_us: YOU PUNK...!

source: 집사레인저
en_us: MEOW RANGERS

source: 지구인 여러분, 주목해주십시오.
en_us: ATTENTION, CITIZENS OF EARTH.

source: 오빠!
en_us: HYEONMIN!!!

source: 몇반이야...?
en_us: WHAT CLASS ARE YOU IN?

source: ...응...?
en_us: HUH...?

source: 그럼, 냥인 구조 계획에 대해서 들어볼까.
en_us: SO, LET’S HEAR YOUR PLAN FOR RESCUING CAT PEOPLE.

source: 언제부터!?
en_us: Since when?!

source: 함께 할 수 없다고 말했는데...!
en_us: I TOLD HER I CAN’T JOIN THEM...!

source: ...꼭...
en_us: YOU BETTER...

source: 네가 개조된 씨몽키...
en_us: ARE YOU THE REPROGRAMMED C-MONKEY...

source: 왕...자?
en_us: YOUR ROYAL... HIGHNESS?

source: 냥행성 발전에 엄청난 기여를 할 수 있을 겁니다.
en_us: ...IT’D BE A MASSIVE CONTRIBUTION TO THE DEVELOPMENT OF CAT PLANET.

source: 네가 집사레인저로서 싸우는 이유를!!
en_us: WHY DO YOU FIGHT AS A MEOW RANGER?!

source: 힘든 상황에 죄송하지만...
en_us: I’M SORRY TO ASK IN THIS DIFFICULT TIME...

source: - 미끼 -
en_us: - BAIT -

source: 사과 안 하고!
en_us: HE’S NOT APOLOGIZING?!

source: 도움 / 김용희 백주원
en_us: ASSISTANCE: YONGHUI KIM JUWON BAEK

source: 마침 좋을 때 오셨군요.
en_us: ACTUALLY, YOU PICKED A GOOD TIME TO COME.

source: 집사레인저?!
en_us: is a Meow Ranger?!

source: 어이쿠야.
en_us: WHOA.

source: 상태 좀 볼가.
en_us: LET’S HAVE A LOOK.

source: ...아냐,
en_us: NAH...

source: 찰랑
en_us: SLOSH

source: 태어나고 싶지도 않았어...!!
en_us: ...TO BE BORN ANYWAY...!!

source: 어차피 믿는 수밖에 없는데.
en_us: I HAVE NO CHOICE BUT TO TRUST YOU ANYWAY.

source: 또 보는군.
en_us: YOU AGAIN.

source: 집사레인저들은 뭘 위해서 목숨을 걸고 싸워왔던 걸까...?
en_us: THEN WHAT DID THE MEOW RANGERS RISK THEIR LIVES TO FIGHT FOR?

source: 너는 나한테 손가락 하나 못 대!!
en_us: YOU CAN’T LAY A FINGER ON ME!

source: 작전에서 물러나마.
en_us: ...THEN I WITHDRAW FROM THE OPERATION.

source: 오빠아!!!
en_us: HYEONMIIIN!!!

source: 호식이 일은...
en_us: ABOUT HOSIK...

source: 오랜만이군.
en_us: LONG TIME NO SEE.

source: 두동강 내버리겠어.
en_us: I WILL CUT YOU IN HALF.

source: 뭘 망설이지.
en_us: WHY ARE YOU HESITATING?

source: 함선에서 원하는 것이 그런 것이라면...
en_us: IF THIS IS WHAT THOSE ON THE SHIP WANT...

source: 말리지 마.
en_us: DON’T TRY TO STOP ME.

source: 그 능력의 비밀을 알아냈나?
en_us: ...THE CAT PERSON’S PSYCHOKINETIC ABILITIES?

source: 뭐해 저 녀석!
en_us: WHAT IS HE DOING?!

source: 뚜벅
en_us: STEP

source: 촤{j}악
en_us: SLASH{j}

source: 말로만 듣던 [인간 청소]라는 것을 직접 보게 되는 걸까.
en_us: AM I ABOUT TO WITNESS THE INFAMOUS HUMAN WIPEOUT?

source: 슈트가 버틸지언정 빠져나오기는 힘들어!
en_us: ...THE SUIT WILL HOLD, BUT IT’LL BE TOUGH TO GET OUT FROM UNDER IT!

source: 현민아~ 혜민이 왔..
en_us: HYEONMIN, HYEMIN’S HERE--

source: 그렇게 못하고 지금처럼 발만 동동 구르는 데는 이유가 있지.
en_us: ...BUT THERE’S A REASON WHY WE CAN’T AND ARE JUST FRETTING ABOUT.

source: 냥인을 초월한...
en_us: AN OPPORTUNITY TO MEET SOMETHING MORE THAN A CAT PERSON...

source: 뽀로롱
en_us: SWOOSH

source: 냥잼을 수거함으로서 앞당길 수 있었던 냥이 [구원].
en_us: ...BUT THE CAT PEOPLE’S REDEMPTION THAT COULD HAVE BEEN FAST-TRACKED BY OBTAINING THE MEOW GEM...

source: ...뭐...?
en_us: WHAT...?

source: 네로라는 자가 동료를 모은다더군.
en_us: SOMEONE CALLED NERO IS GATHERING COMRADES.

source: 촤{j}라{j}락
en_us: WHOOSH{j}{j}

source: 위 이 잉..
en_us: PRRRR

source: 그 부분이 조금 복잡합니다.
en_us: THAT PART IS A BIT COMPLICATED.

source: 냥인이 우습냐?
en_us: YOU THINK CAT PEOPLE ARE A JOKE?

source: 깜돌은 적의 피를 말려 죽이는 타입...
en_us: SHADOW’S A COLD-BLOODED KILLER...

source: 임무를 성공시키지 위해 모은 부하인데,
en_us: YOU RECRUITED THEM TO COMPLETE THE MISSION,

source: 저번엔 잘도!!
en_us: THIS IS FOR LAST TIME!!

source: 가만히 좀 있어!!
en_us: STAY STILL,

source: 모두가 오염된 지구로 내려가는 것을 꺼려했을 때,
en_us: WHILE EVERYONE ELSE WAS RELUCTANT TO GO DOWN TO THE CONTAMINATED EARTH,

source: 읏차,
en_us: HUP.

source: 어디까지 알고 있지!?
en_us: HOW MUCH DO YOU KNOW?!

source: 언제 죽었는지도 모를 만큼 편안한 [죽음]
en_us: A DEATH SO PEACEFUL YOU WON’T EVEN NOTICE WHEN IT HAPPENS.

source: 픕
en_us: PFFT!

source: 민식아...!
en_us: MINSIK...!

source: 이 ㄱ자식아!!!
en_us: YOU BITCH!!!

source: 네로를 죽여버릴 거라고!
en_us: I’M GONNA KILL NERO!

source: XXX가 때렸다고오~!
en_us: THAT JERK HIT ME!

source: 내려가!!!
en_us: GO BACK DOWN!!!

source: 그깟 지각이 무슨 소용이야.
en_us: WHO KNOWS WHAT WILL HAPPEN THE DAY AFTER TOMORROW...?

source: 지구를 향해 날아오고 있는 함선을 보다 더 안전하게 착륙시킬 수 있습니다.
en_us: IT MAKES LANDING THE SHIP THAT’S ON ITS WAY TO EARTH MUCH SAFER.

source: 하지만!!
en_us: HOWEVER!!

source: 집에서 사는 냥인들은, 싸움이라는 걸 해본 적이 없겠지...
en_us: HOUSE CATS WOULDN’T HAVE FIGHTING EXPERIENCE...

source: 우왓-!!
en_us: WHOA!!

source: 설마...
en_us: DID YOU JUST...

source: 단순 청소로는 업정 인정을 받기 힘들죠.
en_us: A MERE WIPEOUT DOESN’T DO ANYTHING.

source: 언제까지 여기에 있으려고...?
en_us: HOW LONG ARE THEY GOING TO STAY...?

source: 강해!!
en_us: SHE’S STRONG!!

source: 잊어라...!!
en_us: FORGET...

source: 다음 단계로 넘어가자구.
en_us: LET’S PROCEED TO THE NEXT PHASE.

source: 하지만 알아 둬야 할 게 있지.
en_us: BUT, THERE’S SOMETHING YOU SHOULD KNOW.

source: 냥인을 지키기 위해 싸우는 우리들을 욕되게 할 셈이냐...
en_us: YOU THINK YOU CAN TARNISH OUR FIGHT TO PROTECT CAT PEOPLE...?

source: 뭐야 이건...
en_us: WHAT’S THAT...?

source: 겁나 궁금해!
en_us: I’M DYING TO KNOW!

source: 질긴 녀석!
en_us: STUBBORN FOOL!

source: 너희들도 알고 있을 거다.
en_us: YOU PROBABLY ALREADY KNOW ABOUT...

source: 건방지긴...!
en_us: ARROGANT BASTARD...!

source: 뭔데...{j}오그라들게.
en_us: WHY’RE YOU BEING SO... CRINGEY?{j}

source: 따 다 다 닥
en_us: GRIND

source: 다...
en_us: WHO...

source: 아아악!!
en_us: AAAGH!!

source: 죽으러 가는 것도 아닌데 뭘 그렇게 슬퍼해?
en_us: WHY ARE YOU SO SAD? IT’S NOT LIKE I’M HEADING TOWARD MY DEATH.

source: 너도!
en_us: LOOK WHO’S TALKING!

source: 너 지금 안 보이는 구나!!
en_us: YOU CAN’T SEE RIGHT NOW...

source: 닷
en_us: DASH

source: 체다...
en_us: CHEDDAR...

source: 영생을 낭만으로 생각하다니.
en_us: TO ROMANTICIZE IMMORTALITY.

source: [역방향 텔레포트 장치]를 작동시키는 것이 제 임무.
en_us: MY MISSION IS TO ACTIVATE THE REVERSE TELEPORTATION DEVICE.

source: 현민아!!!
en_us: HYEONMIN...!!

source: 실컷 긁어.
en_us: HAVE AT IT.

source: 위험해!
en_us: THIS BASTARD

source: 염동력을 가진 냥인...
en_us: HAVE YOU DISCOVERED THE SECRET TO...

source: 이대로는 오빠가-!!
en_us: AT THIS RATE, SHE’LL GET HYEONMIN...!!

source: 친구들은!
en_us: WHAT ABOUT OUR FRIENDS?!

source: 하지만, 지금의 씨몽키들이 알려주고 있죠.
en_us: HOWEVER, AS THE C-MONKEYS HAVE DEMONSTRATED TO US...

source: 롱캣을 넘기고 도망칠까!?
en_us: SHOULD I JUST HAND OVER LONG CAT AND RUN AWAY?!

source: 부하들을 필요이상으로 아끼시는 군요.
en_us: YOU CARE TOO MUCH FOR YOUR SUBORDINATES.

source: 잘생긴 얼굴 다치고 싶지 않으면 그냥 가...!!
en_us: GO ON YOUR WAY UNLESS YOU WANT YOUR PRETTY FACE WRECKED...!!

source: 설마 친구의 소중한 사람을 박살낼 생각은 아니겠지?
en_us: SURELY YOU WOULDN’T DESTROY SOMEONE IMPORTANT TO YOUR FRIEND, RIGHT?

source: 얼마나 많은 사람들이 이 모습을 본 거야...!?
en_us: HOW MANY PEOPLE HAVE SEEN ME IN THIS...?!

source: J-94모델을 신인류로 사용하지 않는 이유는 뭐지?
en_us: WHY NOT USE MODEL J-94 FOR THE NEOHUMAN?

source: 푸욱
en_us: STAB

source: -쥐돌이-
en_us: - MOUSEY -

source: 이토록 쉽게...
en_us: ...LIKE IT WAS NOTHING...

source: 어...!?
en_us: HUH...?!

source: 그깟 허접한 슈트로 어딜 덤비려고.
en_us: YOU DON’T STAND A CHANCE WITH THAT GARBAGE SUIT.

source: 수컷이라면 죽이 되든 밥이 되든 덤벼야지.
en_us: MEN FIGHT TO THE END, NO MATTER THE COST.

source: 그런 약한 마음으로도 위험한 싸움에 함께 해준... '너'에게.
en_us: ...BUT FOR YOU, WHO TOOK THE RISK TO FIGHT ALONGSIDE THEM, DESPITE YOUR RELUCTANCE.

source: 혹시...
en_us: COULD I...

source: ...꺼져.
en_us: GET LOST.

source: 혜민이, 너~?
en_us: WHAT ABOUT IT, HYEMIN?

source: 수컷의 마지막을 방해할 셈이냐!
en_us: ARE YOU INTERRUPTING A MAN’S FINAL MOMENTS?!

source: 누워있었나요?
en_us: HAVE I BEEN LAYING HERE?

source: 제발 거짓말이라고 해줘!!
en_us: PLEASE TELL ME YOU’RE LYING!!

source: 내 근육에 상처하나 못 낼 테니까.
en_us: IT’LL BOUNCE RIGHT OFF MY MUSCLES.

source: 온전한 불로불사가 되기 위해...!!
en_us: SO YOU CAN BECOME IMMORTAL...!!

source: 콰{j}아{j}아
en_us: SPLAAAT{j}{j}

source: 탓
en_us: GRAB

source: 근데...
en_us: ANYWAY...

source: 그들이 사는 곳은 도시였겠지만, 삶은 야생이었겠죠.
en_us: THEY MAY HAVE LIVED IN CITIES, BUT THEIR LIVES WERE NO DIFFERENT FROM THE WILD.

source: 내 이름은 김세호.
en_us: MY NAME IS SEHO KIM.

source: 싸늘-
en_us: COLD

source: 서두르지 않아도 돼.
en_us: THERE’S NO NEED TO HURRY.

source: 호열 아저씨!?
en_us: MR. HOYEOL?!

source: 바박
en_us: THWACK WHAM

source: 앙대...!!
en_us: NNOO...!!

source: 방해 될 녀석이라면 없는게 나아.
en_us: WE’RE BETTER OFF WITHOUT ANYONE STANDING IN OUR WAY.

source: ...이게 중요한 게 아니라.
en_us: BUT THAT’S NOT WHAT’S IMPORTANT.

source: 거대 로봇은 처음이지?
en_us: FIRST TIME IN A GIANT ROBOT?

source: 제엔장...!!
en_us: DAAMN...!!

source: 꽤 하잖아...!
en_us: HE’S GOOD...!

source: 남이 끼어들면 오히려 방해만 될 거야.
en_us: ANYONE BUTTING IN WOULD JUST GET IN HIS WAY.

source: 싸울 각오가 안 됐으면, 빠져라.
en_us: IF YOU’RE NOT READY TO FIGHT, THEN LEAVE.

source: 사이캣씨가 가진 능력의 비밀을 알아낸다면...
en_us: IF WE CAN DISCOVER THE SECRET OF HER POWERS...

source: 냥?!
en_us: MEOW

source: 아저씨 같은 아버지가 있어서...
en_us: ...FOR HAVING A FATHER LIKE YOU...

source: 저 엉터리 설명은 뭐야!
en_us: WHAT KIND OF GARBAGE EXPLANATION WAS THAT?!

source: 왜 왔어?
en_us: WHY’RE YOU HERE?

source: 조상님들도 참 ㅎ;;
en_us: SHEESH, OUR ANCESTORS... HAHA.

source: 우오오오-!!
en_us: WHOOOA!!!

source: 하-씨 ㅋㅋㅋ 옛날 생각나네...
en_us: HAH. YOU REMIND ME OF THE OLD DAYS...

source: 아 그러세요?
en_us: REALLY... BRO?

source: 나라고 이런게 좋은게 아니야!
en_us: I’M NOT SAYING IT BECAUSE I WANT TO!

source: 겨눌 수 조차 없을 걸.
en_us: ...YOU WON’T EVEN BE ABLE TO AIM IT AT ME.

source: 붕
en_us: WHIRL

source: 백날 쏴보라고.
en_us: FIRE AWAY ALL YOU WANT.

source: 유 이 잉
en_us: ZOOM

source: 뭔가 착각하고 있군.
en_us: YOU MISUNDERSTOOD.

source: 네로한테 복수 할 수 있을 정도로 회복 된 거야?
en_us: HAVE YOU RECOVERED ENOUGH TO GET REVENGE ON NERO?

source: 인류를 지켜야만 하는 이유를!!
en_us: WHY MUST YOU PROTECT HUMANKIND?!

source: 알았다.
en_us: FINE.

source: 이런 상태로 전투는...어려워...!!
en_us: FIGHTING IN THIS CONDITION... WILL BE DIFFICULT...!!

source: 녀석이 쓰러져 있다면 다시 [풍선 근육 모드]로 바꿔서...!!
en_us: IF HE’S DOWN, THEN I’LL SWITCH BACK TO INFLATED MUSCLE MODE...!!

source: 이 자식!!
en_us: YOU PUNK!!

source: 냐 아 아
en_us: MEOOOW

source: 디비님, 조심하십시오.
en_us: MASTER DB, BE CAREFUL.

source: 붙잡을 수가...!!
en_us: I CAN’T HOLD HIM...!!

source: 콰 아 아 아
en_us: PSHHHAAA

source: 냥인에게 복종하는 것은 확인이 되었지만,
en_us: WE CONFIRMED THE SUBJECT OBEYS CAT PEOPLE...

source: 버 럭
en_us: ROAR

source: 아니, 연속 냥냥펀치다!!
en_us: I MEAN, CONTINUOUS MEOW PUNCH!!

source: 어쩐지 몸이 말도 안 되게 무겁더라니...
en_us: NO WONDER I FEEL SO SLUGGISH...

source: 넷?!
en_us: YES?

source: 염동력을 쓰는 냥인...
en_us: HAVE YOU DISCOVERED THE SECRET TO...

source: 자기만 좋은 슈트입고...
en_us: SHE HAS THE GOOD SUIT...

source: 내 냥잼...!
en_us: IT’S MY MEOW GEM...!

source: 무기를 들고 온 거냐?
en_us: YOU BROUGHT A WEAPON?

source: 일어서!!
en_us: GET UP!!

source: 괴력이라던가.
en_us: OR INCREDIBLE STRENGTH.

source: 크윽!!
en_us: AGH!!

source: 나도 내 주먹을 멈출 수 없다고!!
en_us: EVEN I CAN’T STOP MY OWN FIST NOW!!

source: 뭐냐고!
en_us: WHAT THE HELL?!

source: 그만 싸워!
en_us: STOP FIGHTING!

source: 힘이 실린 주먹을 날려야 해...!
en_us: I’VE GOT TO HIT HER WITH A HAYMAKER...!

source: 건너편 사람들이!!!
en_us: OH NO! THE PEOPLE ON THE OTHER SIDE!!!

source: 원칙대로라면 말이죠!
en_us: THOSE ARE THE RULES!

source: 3일...!?
en_us: THREE DAYS...?!

source: 니까짓게 뭐라고
en_us: WHY THE HELL...

source: 어딜 도망가!
en_us: WHERE DO YOU THINK YOU’RE GOING!

source: 계속 울대를 노리는데...!!
en_us: THEY KEEP HITTING ME IN THE THROAT...

source: 저...{j}저게 뭐꼬!!
en_us: WH-WHAT’S HE DOING?!{j}

source: 숨어지내던 냥인들이 인간과 똑같은 지위를 갖게 됐을 뿐.
en_us: THE PREVIOUSLY HIDDEN CAT PEOPLE SIMPLY OBTAINED THE SAME STANDING AS HUMANS.

source: 언제까지 나를 붙잡아 둘수 있을 것 같나?
en_us: HOW LONG DO YOU THINK YOU CAN HOLD ME BACK?

source: - 전쟁터 (15) -
en_us: - BATTLEFIELD (15) -

source: 호식이도 아저씨를 최고의 아버지라고 생각할 거예요.
en_us: HOSIK THOUGHT OF YOU AS THE BEST FATHER IN THE WORLD.

source: 겁나 수상하잖아!
en_us: IT’S OBVIOUSLY SUSPICIOUS!

source: 오{j}싹
en_us: SHIVER{j}

source: 네가 내게 입힌 상처...
en_us: THE WOUND YOU INFLICTED ON ME...

source: 비록 적이지만...
en_us: ...THOUGH YOU MAY BE MY ENEMY...

source: 크...
en_us: AGH...

source: 너희들이 그렇게 원하던 거 아니었어!?
en_us: ISN’T THIS WHAT YOU WANTED?!

source: 저는 괜찮으니...!!
en_us: I’LL BE OKAY...

source: 기뻐해라.
en_us: CHEER UP.

source: 디비님...
en_us: MASTER DB...

source: 내가 집사레인저가 된 이유를 말하기 전에...
en_us: BEFORE I TELL YOU WHY I BECAME A MEOW RANGER...

source: 드 르 륵
en_us: SLIDE

source: 지 잉
en_us: VWOOM

source: 근육...
en_us: MUSCLE...

source: ...하긴, 이젠 아무래도 상관없나.
en_us: WELL... I GUESS IT DOESN’T REALLY MATTER ANYMORE.

source: 퍼억 퍽
en_us: WHAM WHACK

source: 지구의 생태계를 지키기 위해 목숨 걸고 싸우고 있지.
en_us: TOGETHER WITH MASTER NERO, WE PUT OUR LIVES ON THE LINE TO PROTECT THE EARTH’S ECOSYSTEM.

source: 우다{j}다
en_us: WOOSH{j}

source: 해산하십시오.
en_us: YOU ARE DISMISSED.

source: 어이구...
en_us: MY GOODNESS...

source: 기억을 잃지 않았어...
en_us: I HAVEN’T LOST MY MEMORY...

source: 나는 냥인 쭈글ㅇ..
en_us: I AM CAT PERSON--

source: 썩 꺼져!!!
en_us: OUT OF MY WAY!!!

source: 이런다고 뭐가 달라질 것 같으냐-!!
en_us: YOU THINK THIS CHANGES ANYTHING?!

source: 어디 학교??
en_us: WHERE TO??

source: 치익
en_us: HISS

source: 고양이 귀여워!
en_us: THAT CAT IS SO CUTE!

source: J-94는 본능속에 냥인에 대한 [공포]를 심은 실험체입니다.
en_us: WE PLANTED FEAR OF CAT PEOPLE INTO THE INSTINCTS OF SUBJECT J-94.

source: 당신이 말로만 듣던...
en_us: I’VE HEARD ALL ABOUT YOU...

source: 신기술!?
en_us: IS THAT A NEW SKILL?!

source: 당신들이 이런 일을 벌인 거 아니야!?
en_us: DID YOU PEOPLE START ALL OF THIS?!

source: 우리 동생 내년에 고등학생인데...
en_us: SHE’S STARTING HIGH SCHOOL NEXT YEAR...

source: 3개 였네...?
en_us: ...THREE MEOW GEMS...?

source: 콰 광
en_us: CRASH THUMP

source: 더 원대한 계획이 있습니다.
en_us: I HAVE GREATER ASPIRATIONS.

source: 이 가짜 평화가 언제까지 계속 될 것 같나.
en_us: HOW LONG DO YOU THINK THIS FALSE PEACE IS GOING TO LAST?

source: 지금 이 순간 부로 우리 냥인이 지구를 지배합니다.
en_us: AS OF THIS MOMENT, CAT PEOPLE RULE THE EARTH.

source: 이...{j}이!!!
en_us: Y-YOU...{j}

source: 어느정도 진전이 있었습니다.
en_us: WE’VE MADE SOME PROGRESS.

source: 주 륵
en_us: DROP

source: 드르륵
en_us: SLIDE

source: 인간 재활용이라...
en_us: RECYCLING HUMANS, HUH...?

source: 민식군!!
en_us: MINSIK!!

source: ...네.
en_us: YES.

source: 아니면 제일 마지막에?
en_us: OR SAVE HIM FOR LAST?

source: 사실은 벌써 이곳의 연구원들이 보다 완벽한 인류를 만들고 있죠.
en_us: IN FACT, OUR RESEARCHERS ARE ALREADY BUILDING A PERFECTED HUMANKIND.

source: 따돌렸나...?
en_us: DID I LOSE THEM...?

source: 더 나아질 수 있었던 냥인의 [운명].
en_us: THE FATES OF ALL CAT PEOPLE THAT COULD HAVE BEEN IMPROVED...

source: 왜 다 나한테 떠넘기려고 하냐?
en_us: WHY ARE YOU PUTTING EVERYTHING ON ME?

source: 넵.
en_us: YES, SIR.

source: 네놈들한테 언제 어떻게 당할 줄 알고?
en_us: HOW WOULD I KNOW WHEN YOU GUYS DECIDE TO ATTACK?

source: 어이, 박사!
en_us: YO, DOC!

source: 와락
en_us: GRAB

source: 이것 들은!!
en_us: WHO THE HELL ARE YOU?!

source: 다 죽게 생겼다고!!
en_us: WE’RE ALL ABOUT TO DIE HERE!!

source: 바보 자식...!
en_us: THAT FOOL...!

source: 왕자였나?
en_us: YOU’RE A PRINCE?

source: 비겁한 놈!
en_us: SNEAKY BASTARD!

source: 거기 스탑-!!
en_us: STOP RIGHT THERE!

source: 지구에서의 여정은 어떠셨습니까.
en_us: HOW WAS YOUR TRIP TO EARTH?

source: 당신이 이 힘을 갖는게 맞을까?
en_us: IS IT RIGHT FOR YOU TO HAVE THIS POWER?

source: 물체를 보내는 것이 아닌 불러오는 것.
en_us: IT DOESN’T SEND THINGS OUT, IT RETRIEVES THEM.

source: 네 희생이 헛되게 되지 않도록, 모든 것을 바로 잡으마.
en_us: I WILL MAKE THINGS RIGHT SO THAT YOUR SACRIFICE WILL NOT HAVE BEEN IN VAIN.

source: 뭐야!?
en_us: WHAT THE HELL?!

source: - 전쟁터 (14) -
en_us: - BATTLEFIELD (14) -

source: 구속수를 채우겠습니다.
en_us: I’M PUTTING YOU IN THESE RESTRAINTS.

source: 쉬어야 하지 않겠나.
en_us: ...SO WE CAN REST.

source: 캣슈트라뇨...?
en_us: YOU MENTIONED A CATSUIT...?
